# DuplicateTypeNamesHandlerArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuplicateTypeNamesHandlerArgs Members
DuplicateTypeNamesHandlerArgs Class Methods Properties See Also
---
The DuplicateTypeNamesHandlerArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DuplicateTypeNamesHandlerArgs |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeIds | Returns ids of the types with duplicate names. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document that contains the types with duplicate names. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace